# Pamdas Merging Function 
### pandas merge two columns or indexes in DataFrame based on one or more keys

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'ID':[1,2,3,4],
                   'Class':[4,5,6,7]})
df1

   ID  Class
0   1      4
1   2      5
2   3      6
3   4      7

In [3]:
df2 = pd.DataFrame({'ID':[1,2,3,4],
                   'Name':['A','B','C','D']})
df2

   ID Name
0   1    A
1   2    B
2   3    C
3   4    D

In [4]:
pd.merge(df1,df2, on = 'ID') # Indexes columns must be present in bht DataFrame, mean ID column is present in bht

   ID  Class Name
0   1      4    A
1   2      5    B
2   3      6    C
3   4      7    D

In [5]:
df3 = pd.DataFrame({'ID':[1,2,3,5],
                   'Class':[4,5,6,7]})
df3

   ID  Class
0   1      4
1   2      5
2   3      6
3   5      7

In [7]:
pd.merge(df2,df3, on = 'ID') # if some values are not same they are not selected , it performs intersection opeeration on IDs

   ID Name  Class
0   1    A      4
1   2    B      5
2   3    C      6

In [8]:
pd.merge(df2,df3, on = 'ID' , how = 'inner')

   ID Name  Class
0   1    A      4
1   2    B      5
2   3    C      6

In [9]:
pd.merge(df2,df3, on = 'ID' , how = 'left') # it gives out on the bases of left defiend DataFrame

   ID Name  Class
0   1    A    4.0
1   2    B    5.0
2   3    C    6.0
3   4    D    NaN

In [10]:
pd.merge(df2,df3, on = 'ID' , how = 'right') # it gives out on the bases of right defiend DataFrame

   ID Name  Class
0   1    A      4
1   2    B      5
2   3    C      6
3   5  NaN      7

In [11]:
pd.merge(df2,df3, on = 'ID' , how = 'outer') # it gives out on the bases of both defiend DataFrame

   ID Name  Class
0   1    A    4.0
1   2    B    5.0
2   3    C    6.0
3   4    D    NaN
4   5  NaN    7.0

In [12]:
pd.merge(df2,df3, on = 'ID' , how = 'outer', indicator = True) # it defines which values belong to which column

   ID Name  Class      _merge
0   1    A    4.0        both
1   2    B    5.0        both
2   3    C    6.0        both
3   4    D    NaN   left_only
4   5  NaN    7.0  right_only

### if the selected indexes are totally different the

In [15]:
df4 = pd.DataFrame({'ID':[6,7,8,9],
                   'Name':['A','B','C','D']})
df4

   ID Name
0   6    A
1   7    B
2   8    C
3   9    D

In [16]:
pd.merge(df3,df4, on = 'ID')

Empty DataFrame
Columns: [ID, Class, Name]
Index: []

In [17]:
pd.merge(df3,df4, left_index = True , right_index = True)

   ID_x  Class  ID_y Name
0     1      4     6    A
1     2      5     7    B
2     3      6     8    C
3     5      7     9    D

In [22]:
df5 = pd.DataFrame({'ID':[1,2,3,4],
                   'Class':[4,5,11,12]})
df5

   ID  Class
0   1      4
1   2      5
2   3     11
3   4     12

In [23]:
pd.merge(df1,df5, on = 'ID')

   ID  Class_x  Class_y
0   1        4        4
1   2        5        5
2   3        6       11
3   4        7       12

In [25]:
pd.merge(df1,df5, on = 'ID', suffixes= ("_Higher","_Middel"))

   ID  Class_Higher  Class_Middel
0   1             4             4
1   2             5             5
2   3             6            11
3   4             7            12